[
  {
    "id": "84028672-0f4d-403f-a6b9-8a241138f6a9",
    "originalName": "Shashank Goud Resume.pdf",
    "filename": "1750863254714_e54d6851_Shashank_Goud_Resume.pdf",
    "path": "uploads\\resumes\\1750863254714_e54d6851_Shashank_Goud_Resume.pdf",
    "size": 211522,
    "mimetype": "application/pdf",
    "uploadedAt": "2025-06-25T14:54:14.732Z",
    "userId": "anonymous",
    "extractedText": "S UMMARY Gangapuram Shashank Goud +91 9515002542 | shashashankgoud300@gmail.com | LINKEDIN | GITHUB Aspiring Full Stack Developer with a strong foundation in web development and backend engineering. Passionate about building intelligent and socially impactful applications. Contributed to the open-source ecosystem via GirlScript Summer of Code (GSSoC). Skilled in modern development stacks, databases, and cloud-based services. Fast learner, enthusiastic coder, and team collaborator. E DUCATION BTech – Maharishi Markandeshwar Deemed To Be University 8.70 CGPA Bachelor of Technology in Computer Science Engineering 2024 - Expected Graduation: July 2027 Diploma - TKR College of Engineering 7.7 CGPA Diploma in Computer Science Engineering 2021 - 2024 E XPERIENCE Open Source Contributor – GirlScript Summer of Code (GSSoC) Remote | Jan 2024 – Present ● Contributed to multiple open-source projects with a focus on full-stack development. ● Reviewed pull requests, raised issues, and implemented new feature sets. ● Improved skills in Git, issue management, collaboration, and documentation . Intern – DRDO Hyderabad, Telangana July 2022 – December 2022 ● Completed a 6-month internship focusing on network infrastructure and basic cybersecurity protocols. ● Gained exposure to firewalls, intrusion detection systems, VPN configuration, and ethical hacking basics. ● Worked with senior engineers on maintaining secure internal communications and data protection. ● Received a Certificate of Completion and a Letter of Recommendation (LOR). P ROJECTS AI-Powered Task Manager ● Designed and developed a productivity platform integrating AI to categorize and prioritize daily tasks. ● Implemented natural language input processing and deadline-based sorting to assist users in time management. ● Tech Stack : Node.js, Express.js, MongoDB, JavaScript\r\nEcoWatt – Environment Awareness Platform ● Web application enabling users to upload images and receive eco-impact analysis. ● Promotes environmental awareness by interpreting uploaded media and offering personalized energy tips. ● Developed a user-friendly interface to engage non-technical users in sustainability efforts. ● Incorporated Firebase services for real-time feedback and data storage. ● Tech Stack: Firebase, JavaScript, HTML, CSS, Bootstrap T ECHNICAL SKILLS • Programming Languages: Python, JavaScript, SQL • Frontend Languages: HTML, CSS, JavaScript, React.js (Basic) • Backend: Node.js, Express.js • Authentication: Firebase Auth, • Tools: Git, GitHub, Visual Studio, Firebase C URRENTLY LEARNING & E XPLORING ● MERN Stack: MongoDB, Express.JS, React.JS, Node.js, Next.JS ● AI Integratoin with Web Application S OFT SKILLS & ACHIEVEMENTS ● Strong Problem-Solving & Critical Thinking : Applied in real-world projects by automating workflows and debugging with AI tools. ● Effective Communication & Presentation: Demonstrated through project documentation, academic presentations, and collaborative development. ● Academic Excellence: Received Certificates of Excellence in the 1st and 2nd years of Diploma in Computer Science Engineering. ● Adaptable & Fast Learner: Quickly picked up modern tools like Next.js, Firebase, and VAPI.ai, and integrated AI tools to accelerate development. ● Project Leadership: Independently led the design and execution of full-stack projects like PrepMate and InterviewMe using AI assistance.",
    "analysisHistory": []
  },
  {
    "id": "9bfd59d9-277f-4f2f-bee9-2aedc23ded13",
    "originalName": "Harsh _Vishwakarma_Resume_2025.pdf",
    "filename": "1750863606604_68b7d7f2_Harsh_Vishwakarma_Resume_2025.pdf",
    "path": "uploads\\resumes\\1750863606604_68b7d7f2_Harsh_Vishwakarma_Resume_2025.pdf",
    "size": 100384,
    "mimetype": "application/pdf",
    "uploadedAt": "2025-06-25T15:00:06.618Z",
    "userId": "anonymous",
    "extractedText": "Harsh Vishwakarma Ambala, India | harshh31linkedin@gmail.com | +91-9685424617 linkedin.com/in/HarshVishwakarma | github.com/HarshtheGeek Education Maharishi Markandeshwar Deemed To Be University , B.Tech in Computer Science ● CGPA: 7.5/10.0 ● Coursework: Computer Architecture, Data Structure and Algorithms, Computational Theory Experience Flutter Developer , MedCortico – Delhi, India Nov 2024 – Feb 2025 ● Leading development of an EMR Application to eliminate manual typing in medical documentation. ● Automating voice-to-text conversion, reducing documentation time by 60% . ● Enhancing document speed and accuracy, increasing operational efficiency by 50% . Core Team Member , Google Developer Groups – Ambala, India Sep 2023 – Working ● Actively contributing to the club by volunteering for App Dev, Blockchain mentoring ● Developing cross platform applications using Flutter and Firebase for Hackathons ● Delivering strategic expertise to enhance the club's growth and overall well-being. Projects MemoryBox https://github.com/HarshtheGeek/memory_box ● Integrated features to enhance daily living and cognitive engagement , fostering meaningful interactions and improved memory retention. ● Achieved a 30% increase in caregiving efficiency through automated reminders, activity tracking, and personalized cognitive exercises. ● Tools Used: Flutter, Firebase, NodeJS, MongoDB, Mongoose, Express JS FarmGPT https://github.com/HarshtheGeek/FarmGPT ● AI-driven platform delivering precise disease diagnostics, treatment recommendations, and preventive insights for agricultural crops. ● Real-time plant and soil analysis through image capture and upload, enhanced by multi-language support for global accessibility. ● Integrated Gemini API-powered chatbot offering context-aware, accurate responses to agriculture-related queries, streamlining decision-making. ● Tools Used: Flutter, Firebase, Gemini API Technologies Programming Languages: C++ | Python | Dart | Solidity | JavaScript | C Language Frameworks & Libraries: Flutter | Foundry | Express.js | Mongoose | OpenCV | GetX | Riverpod Backend & Databases: Node.js | Firebase | MySQL | MongoDB | REST API’s | GraphQL Achievements Android App Challenge Winner (2024) — Sponsored by Google, organized at Chandigarh University. Top 6 Finalist in National Innovation Award (2024) — Held at Panipat Institute of Technology.",
    "analysisHistory": []
  }
]